supporter_app/app/controllers/support_requests_controller.rb

SELECT  "support_requests".* FROM "support_requests" WHERE "support_requests"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show

    p "inside show"
    p params
    @support_request = SupportRequest.find params[:id]

SELECT "support_requests".* FROM "support_requests" WHERE (name ILIKE '%ian%' OR email ILIKE '%ian%' OR department ILIKE '%ian%' OR message ILIKE '%ian%')  ORDER BY done
SELECT  "support_requests".* FROM "support_requests" WHERE (name ILIKE '%jacob%' OR email ILIKE '%jacob%' OR department ILIKE '%jacob%' OR message ILIKE '%jacob%')  ORDER BY done LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM "support_requests" WHERE (name ILIKE '%jacob%' OR email ILIKE '%jacob%' OR department ILIKE '%jacob%' OR message ILIKE '%jacob%')
SELECT  "support_requests".* FROM "support_requests"  ORDER BY "support_requests"."done" ASC LIMIT 7 OFFSET 0
---
  def index
    @support_requests = SupportRequest.all
    # p "params[:search]"
    # p params[:search]
    # p "params[:done]"
    # p params[:done]
    p "params"
    p params
    if params[:search]
      @support_requests = SupportRequest.search(params[:search]).page(params[:page]).per(7)
    # elsif params[:done]
    #   # SupportRequest.update(:done => true)
    #   @support_requests = SupportRequest.search(params[:search])
    #   # @support_requests = SupportRequest.done(params[:done])
    else
      @support_requests = SupportRequest.order(:done).page(params[:page]).per(7)

SELECT  "support_requests".* FROM "support_requests" WHERE "support_requests"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    p "inside edit"
    p params
    # we need to find the question that will be edited
    @support_request = SupportRequest.find params[:id]

SELECT  "support_requests".* FROM "support_requests" WHERE "support_requests"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "support_requests" SET "department" = $1, "updated_at" = $2 WHERE "support_requests"."id" = $3  [["department", "marketing"], ["updated_at", "2016-02-09 09:21:56.056306"], ["id", 1]]
---
  def update
    p "inside update"
    p params.length
    # we need to feth the question first to update it
    @support_request = SupportRequest.find params[:id]
    p "@support_request.done"
    p @support_request.done

    if params.length == 5
      if @support_request.done
        support_request_params = {:done => false}
      else
        support_request_params = {:done => true}
      end

      @support_request.update support_request_params

SELECT  "support_requests".* FROM "support_requests" WHERE "support_requests"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "support_requests" WHERE "support_requests"."id" = $1  [["id", 6]]
---
  def destroy
    @support_request = SupportRequest.find params[:id]
    @support_request.destroy