__supporter_app/app/controllers/products_controller.rb

  def create
    product_params = params.require(:product).permit([:name, :description, :price])
    @product = Product.new product_params
    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asldkjf"], ["description", "asdl;kfj"], ["price", 10.0], ["created_at", "2016-02-03 22:57:32.051506"], ["updated_at", "2016-02-03 22:57:32.051506"]]

  def show
    @product = Product.find params[:id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    # we need to find the question that will be edited
    @product = Product.find params[:id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def update
    # we need to feth the question first to update it
    @product = Product.find params[:id]
    # we must use strong params to only allow updating the title/body
    product_params = params.require(:product).permit([:name, :description, :price])
    #we call the update with sanitized params
    if @product.update product_params
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Jacob"], ["updated_at", "2016-02-04 00:16:47.648067"], ["id", 3]]

  def destroy
    @product = Product.find params[:id]
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]